# SQL Subqueries - Lab Assignment #2

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="img/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data2.sqlite` in the data folder.

In [2]:
# Your code here; import the necessary packages
import sqlite3
import pandas as pd

In [3]:
# Your code here; create the connection
conn = sqlite3.Connection("data/data2.sqlite")

## Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

```
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [16]:
# Your code here
pd.read_sql('''
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM
    customers
WHERE customerNumber IN
(
    SELECT
       customerNumber
    FROM
        orders
    WHERE
        orderDate = '2003-01-31'
)
    
''', conn)

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [15]:
# Your code here
q2 = """
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
"""
                 
pd.read_sql(q2, conn)

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [11]:
# Your code here
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT
pd.read_sql('''
SELECT
    customerName,
   customerNumber
FROM
    customers
''', conn)

                       customerName  customerNumber
0                 Atelier graphique             103
1                Signal Gift Stores             112
2        Australian Collectors, Co.             114
3                 La Rochelle Gifts             119
4                Baane Mini Imports             121
..                              ...             ...
117    Motor Mint Distributors Inc.             486
118        Signal Collectibles Ltd.             487
119  Double Decker Gift Stores, Ltd             489
120            Diecast Collectables             495
121               Kelly's Gift Shop             496

[122 rows x 2 columns]

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
# Your code here
pd.read_sql('''
SELECT
    e.employeeNumber,
    e.firstName,
    e.lastName,
    o.city,
    e.officeCode
FROM
    employees e
JOIN
    offices o
        USING(officeCode)
JOIN customers c
    ON
        e.employeeNumber = c.salesRepEmployeeNumber
JOIN
    orderdetails od
        USING(orderNumber)
WHERE officeCode IN
(
    SELECT
        productCode
    FROM
        offices
    JOIN
        orderdetails od
            USING(productCode)
    JOIN
        USING()
    JOIN
        USING()
    GROUP BY
        
    HAVING
        COUNT(*) < 20
)
''', conn)

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [ ]:
# Your code here
pd.read_sql('''
SELECT
    employeeNumber,
    firstName,
    lastName,
    
''', conn)

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!